tests/lsi_firmware_ram_slog_fio_pod.txt
fio-s88mk
testjob: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=128
...
fio-3.19
Starting 12 processes
testjob: Laying out IO file (1 file / 1024MiB)
testjob: Laying out IO file (1 file / 1024MiB)
testjob: Laying out IO file (1 file / 1024MiB)
[...]

testjob: (groupid=0, jobs=12): err= 0: pid=9: Fri May 14 22:31:46 2021
  read: IOPS=14.0k, BW=110MiB/s (115MB/s)(6578MiB/60037msec)
    slat (usec): min=5, max=535077, avg=312.11, stdev=2555.55
    clat (usec): min=499, max=3805.0k, avg=52840.42, stdev=73517.68
     lat (usec): min=531, max=3805.0k, avg=53160.72, stdev=73965.37
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    6], 10.00th=[    9], 20.00th=[   17],
     | 30.00th=[   26], 40.00th=[   35], 50.00th=[   44], 60.00th=[   52],
     | 70.00th=[   62], 80.00th=[   74], 90.00th=[   95], 95.00th=[  118],
     | 99.00th=[  224], 99.50th=[  347], 99.90th=[ 1133], 99.95th=[ 1418],
     | 99.99th=[ 2333]
   bw (  KiB/s): min= 1566, max=270549, per=100.00%, avg=112595.47, stdev=3996.57, samples=1426
   iops        : min=  194, max=33817, avg=14072.30, stdev=499.55, samples=1426
  write: IOPS=14.0k, BW=110MiB/s (115MB/s)(6581MiB/60037msec); 0 zone resets
    slat (usec): min=6, max=548886, avg=322.95, stdev=2867.19
    clat (usec): min=1824, max=3805.0k, avg=57066.89, stdev=78294.61
     lat (usec): min=1855, max=3805.0k, avg=57398.81, stdev=78796.71
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   12], 20.00th=[   21],
     | 30.00th=[   30], 40.00th=[   39], 50.00th=[   47], 60.00th=[   56],
     | 70.00th=[   66], 80.00th=[   79], 90.00th=[  101], 95.00th=[  125],
     | 99.00th=[  245], 99.50th=[  380], 99.90th=[ 1200], 99.95th=[ 1536],
     | 99.99th=[ 2400]
   bw (  KiB/s): min= 1551, max=272996, per=100.00%, avg=112577.16, stdev=3981.19, samples=1427
   iops        : min=  193, max=34123, avg=14070.03, stdev=497.63, samples=1427
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=1.39%, 10=8.36%, 20=12.05%, 50=33.88%
  lat (msec)   : 100=35.05%, 250=8.45%, 500=0.58%, 750=0.12%, 1000=0.06%
  lat (msec)   : 2000=0.13%, >=2000=0.02%
  cpu          : usr=2.00%, sys=5.40%, ctx=1624080, majf=0, minf=699
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=841244,841484,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=110MiB/s (115MB/s), 110MiB/s-110MiB/s (115MB/s-115MB/s), io=6578MiB (6897MB), run=60037-60037msec
  WRITE: bw=110MiB/s (115MB/s), 110MiB/s-110MiB/s (115MB/s-115MB/s), io=6581MiB (6900MB), run=60037-60037msec

Disk stats (read/write):
  sda: ios=839880/840356, merge=1315/1397, ticks=31069598/33075973, in_queue=70529232, util=100.00%