tests/perc_firmware_fio_pod_r620a_1.txt
fio-fddx6
testjob: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=128
...
fio-3.19
Starting 12 processes
testjob: Laying out IO file (1 file / 1024MiB)
testjob: Laying out IO file (1 file / 1024MiB)
testjob: Laying out IO file (1 file / 1024MiB)
[...]

testjob: (groupid=0, jobs=12): err= 0: pid=10: Fri May 14 21:40:52 2021
  read: IOPS=9563, BW=74.8MiB/s (78.4MB/s)(4494MiB/60067msec)
    slat (usec): min=6, max=185483, avg=513.31, stdev=2919.40
    clat (usec): min=212, max=714506, avg=76857.61, stdev=73264.44
     lat (usec): min=246, max=728781, avg=77373.42, stdev=73752.62
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    8], 10.00th=[   12], 20.00th=[   21],
     | 30.00th=[   32], 40.00th=[   44], 50.00th=[   57], 60.00th=[   72],
     | 70.00th=[   91], 80.00th=[  118], 90.00th=[  165], 95.00th=[  218],
     | 99.00th=[  359], 99.50th=[  418], 99.90th=[  550], 99.95th=[  584],
     | 99.99th=[  659]
   bw (  KiB/s): min=12224, max=338633, per=100.00%, avg=76767.05, stdev=4022.94, samples=1428
   iops        : min= 1528, max=42326, avg=9595.14, stdev=502.83, samples=1428
  write: IOPS=9558, BW=74.8MiB/s (78.4MB/s)(4492MiB/60067msec); 0 zone resets
    slat (usec): min=7, max=220318, avg=511.90, stdev=2889.68
    clat (usec): min=543, max=719508, avg=82600.39, stdev=75133.46
     lat (usec): min=588, max=753917, avg=83114.87, stdev=75589.38
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   11], 10.00th=[   15], 20.00th=[   25],
     | 30.00th=[   36], 40.00th=[   49], 50.00th=[   63], 60.00th=[   79],
     | 70.00th=[   97], 80.00th=[  125], 90.00th=[  174], 95.00th=[  228],
     | 99.00th=[  376], 99.50th=[  430], 99.90th=[  558], 99.95th=[  592],
     | 99.99th=[  667]
   bw (  KiB/s): min=13008, max=339699, per=100.00%, avg=76697.82, stdev=4010.41, samples=1428
   iops        : min= 1626, max=42458, avg=9586.42, stdev=501.25, samples=1428
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.35%, 10=5.71%, 20=11.50%, 50=25.46%
  lat (msec)   : 100=29.59%, 250=23.90%, 500=3.39%, 750=0.21%
  cpu          : usr=1.38%, sys=3.23%, ctx=861495, majf=0, minf=699
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=574459,574129,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=74.8MiB/s (78.4MB/s), 74.8MiB/s-74.8MiB/s (78.4MB/s-78.4MB/s), io=4494MiB (4712MB), run=60067-60067msec
  WRITE: bw=74.8MiB/s (78.4MB/s), 74.8MiB/s-74.8MiB/s (78.4MB/s-78.4MB/s), io=4492MiB (4710MB), run=60067-60067msec

Disk stats (read/write):
  sda: ios=599483/599371, merge=53/171, ticks=27572357/29483253, in_queue=63201000, util=100.00%